{
  "categories": {
    "web": {
      "name": "Web Projects",
      "projects": [
        {
          "id": "passkeys",
          "title": "Passkeys with Go",
          "description": "A full-stack authentication demo using Go and React to explore passkeys (WebAuthn) alongside traditional password login. Integrated secure passkey flows with go-webauthn, handled session management using Redis, and added features like email verification, account and passkey management, and Argon2id password hashing. Designed mainly for learning and experimenting with modern auth flows.",
          "image": "passkeys.png",
          "demoUrl": "https://github.com/baala3/passkeys",
          "githubUrl": "https://github.com/baala3/passkeys"
        },
        {
          "id": "rubysamlauth",
          "title": "Ruby SAML Auth",
          "description": "A minimal SAML 2.0 authentication system in pure Ruby, integrated with Okta, handling full SSO/SLO flows and encrypted assertions. Developed entirely from scratch using Rack, Nokogiri, and OpenSSL—without relying on any SAML libraries. This project is to understand SAML internals, XML signatures, and session management deeply.",
          "image": "rubysamlauth.png",
          "demoUrl": "https://github.com/baala3/ruby_saml_auth",
          "githubUrl": "https://github.com/baala3/ruby_saml_auth"
        },
        {
          "id": "graphalogvisualizer",
          "title": "Graph Algorithm Visualiser",
          "description": "A web-based interactive tool to visualize graph algorithms as part of learning Data Structures and Algorithms. It supports BFS, DFS, MST, and Dijkstra’s algorithms, with real-time visualization using React, Fluent UI, and SVG graphics. The project focuses on helping users understand how these algorithms work step-by-step. Deployed on Vercel.",
          "image": "graphalogvisualizer.png",
          "demoUrl": "https://graph-algo-visualizer-mocha.vercel.app/",
          "githubUrl": "https://github.com/baala3/graph-algo-visualizer"
        },
        {
          "id": "hunger-aid",
          "title": "Hunger Aid",
          "description": "A full-stack web app that lets restaurants and users post available surplus food in their area; local charities can browse, search, and get directions to pickup points. Tech Stack: MongoDB (Mongoose), Node.js, Express, React, Redux (React-Redux), Material-UI, Mapbox GL, JWT (Auth), ftp-mail, React Swipeable Views.",
          "image": "hunger-aid.png",
          "demoUrl": "https://hunger-aid.netlify.app/",
          "githubUrl": "https://github.com/baala3/hunger-aid-frontend"
        }
      ]
    },
    "android": {
      "name": "Android Projects",
      "projects": [
        {
          "id": "moretostore",
          "title": "More to Store",
          "description": "More-To-Store is a simple shopping app I built during college, inspired by platforms like Flipkart and Amazon. It lets users browse and purchase items. On the backend, I used Firebase (Realtime Database, Storage, and Authentication), while the frontend is built using Android Architecture Components like ViewPager and RecyclerView (with multi-item support). The app follows a basic MVC architecture for better code management.",
          "image": "app0.png",
          "demoUrl": "https://appetize.io/app/q1edkvrn3p9r3g13x8h0qx5904?device=nexus5&scale=75&orientation=portrait&osVersion=8.1",
          "githubUrl": "https://github.com/baala3/moreToStore"
        },
        {
          "id": "connectify",
          "title": "Connectify",
          "description": "A basic social media app during college with features like chatting and posting, similar to Instagram. Users can sign up, log in, customize their profiles, follow/unfollow others, and interact with posts (like, comment, save). It’s developed using Java/XML, Firebase Realtime Database, Firebase Authentication, and Android Architecture Components for handling UI and data flow.",
          "image": "app1.png",
          "demoUrl": "https://appetize.io/app/q3g294nb7ymgy3a94wn8meky4w?device=nexus5&scale=75&orientation=portrait&osVersion=8.1",
          "githubUrl": "https://github.com/baala3/connectify"
        },
        {
          "id": "weather",
          "title": "Weather",
          "description": "WeatherApp is a simple weather forecast app I built, which pulls 5-day/3-hour forecast data using APIs from OpenWeatherMap. It also supports searching places, cities, countries, and coordinates for weather info. The app handles API integration for fetching and parsing weather data.",
          "image": "app2.png",
          "demoUrl": "https://appetize.io/app/q9e1mrnphbm14p7d02wq4ujqx8?device=nexus5&scale=75&orientation=portrait&osVersion=8.1",
          "githubUrl": "https://github.com/baala3/android-java-projects/tree/main/weather-app"
        }
      ]
    }
  }
}
